In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Sanchita", "Kanika", "Aditya"],
    "marks": [98,99,99]
}

In [3]:
dict1

{'name': ['Sanchita', 'Kanika', 'Aditya'], 'marks': [98, 99, 99]}

In [4]:
df = pd.DataFrame(dict1)
df

       name  marks
0  Sanchita     98
1    Kanika     99
2    Aditya     99

In [5]:
df.describe()

           marks
count   3.000000
mean   98.666667
std     0.577350
min    98.000000
25%    98.500000
50%    99.000000
75%    99.000000
max    99.000000

In [6]:
df.to_csv("marks.csv")

In [12]:
file = pd.read_csv("marks2.csv")

In [13]:
file

       name  marks
0  Sanchita     98
1    Kanika     99
2    Aditya     99

In [14]:
file.index = [1,2,3]

In [15]:
file

       name  marks
1  Sanchita     98
2    Kanika     99
3    Aditya     99

In [19]:
file['name']

1    Sanchita
2      Kanika
3      Aditya
Name: name, dtype: object

In [28]:
data = pd.DataFrame(np.random.rand(10,7))
data

          0         1         2         3         4         5         6
0  0.762989  0.966324  0.983910  0.860354  0.240423  0.639578  0.270580
1  0.572391  0.575428  0.463004  0.779515  0.788094  0.470464  0.112380
2  0.461792  0.455958  0.003469  0.648179  0.509625  0.482618  0.467809
3  0.788634  0.695079  0.071962  0.386221  0.881174  0.206376  0.231827
4  0.792148  0.084015  0.356355  0.340056  0.309771  0.559319  0.867858
5  0.426176  0.060675  0.398459  0.940983  0.672990  0.236444  0.443831
6  0.568609  0.529476  0.465362  0.098494  0.236030  0.043705  0.125676
7  0.786812  0.875118  0.662974  0.043478  0.507406  0.189750  0.232040
8  0.207087  0.296723  0.108865  0.518777  0.191314  0.559516  0.193611
9  0.256434  0.156118  0.103036  0.066781  0.448919  0.558971  0.410564